# PointOnEdgeFaceIntersection Properties

---
The PointOnEdgeFaceIntersection type exposes the following members.
| Name| Description
---|---|---
| OrientWithEdge| Whether to orient the ReferencePoint to the edge or the face.
Top
#### Reference
PointOnEdgeFaceIntersection Class
Autodesk.Revit.DB Namespace